#+TITLE: Digital Painting Fundamentals I
#+AUTHOR: Chris Hogan
#+DATE: <2022-04-11 Mon> to ?
#+STARTUP: nologdone

* Log
** Week 1
  #+BEGIN: clocktable :scope subtree :maxlevel 6 :block thisweek :tags t
  #+CAPTION: Clock summary at [2022-04-17 Sun 20:46], for week 2022-W15.
  | Tags     | Headline                            | Time    |       |      |      |
  |----------+-------------------------------------+---------+-------+------+------|
  |          | *Total time*                        | *44:30* |       |      |      |
  |----------+-------------------------------------+---------+-------+------+------|
  |          | \_  Week 4                          |         | 44:30 |      |      |
  |          | \_    <2022-04-11 Mon>              |         |       | 9:52 |      |
  | drawing  | \_      Scott Robertson perspective |         |       |      | 0:54 |
  | painting | \_      Rendering boxes             |         |       |      | 8:58 |
  |          | \_    <2022-04-12 Tue>              |         |       | 3:33 |      |
  | painting | \_      Rendering extruded boxes    |         |       |      | 3:33 |
  |          | \_    <2022-04-13 Wed>              |         |       | 4:40 |      |
  | 3D       | \_      Blender tutorial            |         |       |      | 0:43 |
  | painting | \_      Rendering extruded boxes    |         |       |      | 3:57 |
  |          | \_    <2022-04-14 Thu>              |         |       | 4:29 |      |
  | painting | \_      Rendering extruded boxes    |         |       |      | 4:29 |
  |          | \_    <2022-04-15 Fri>              |         |       | 3:22 |      |
  | painting | \_      Rendering extruded boxes    |         |       |      | 2:44 |
  | painting | \_      Rendering spheres           |         |       |      | 0:38 |
  |          | \_    <2022-04-16 Sat>              |         |       | 9:38 |      |
  | painting | \_      Rendering spheres           |         |       |      | 9:38 |
  |          | \_    <2022-04-17 Sun>              |         |       | 8:56 |      |
  | painting | \_      Rendering spheres           |         |       |      | 8:43 |
  | study    | \_      Blog                        |         |       |      | 0:13 |
  #+END:
  
  #+BEGIN: clocktable-by-tag :maxlevel 6 :match ("drawing" "study" "painting" "3D")
  | Tag      | Headline   | Time (h)  |
  |----------+------------+-----------|
  | drawing  | *Tag time* | *0h 54m*  |
  |----------+------------+-----------|
  | study    | *Tag time* | *0h 13m*  |
  |----------+------------+-----------|
  | painting | *Tag time* | *42h 40m* |
  |----------+------------+-----------|
  | 3D       | *Tag time* | *0h 43m*  |
  
  #+END:

*** <2022-04-11 Mon>
**** DONE Scott Robertson perspective                               :drawing:
     :LOGBOOK:
     CLOCK: [2022-04-11 Mon 08:49]--[2022-04-11 Mon 09:43] =>  0:54
     :END:
**** DONE Rendering boxes                                          :painting:
     :LOGBOOK:
     CLOCK: [2022-04-11 Mon 18:01]--[2022-04-11 Mon 20:51] =>  2:50
     CLOCK: [2022-04-11 Mon 12:36]--[2022-04-11 Mon 16:48] =>  4:12
     CLOCK: [2022-04-11 Mon 09:43]--[2022-04-11 Mon 11:39] =>  1:56
     :END:
*** <2022-04-12 Tue>
**** DONE Rendering extruded boxes                                 :painting:
     :LOGBOOK:
     CLOCK: [2022-04-12 Tue 18:34]--[2022-04-12 Tue 22:07] =>  3:33
     :END:
*** <2022-04-13 Wed>
**** DONE Blender tutorial                                               :3D:
     :LOGBOOK:
     CLOCK: [2022-04-13 Wed 17:53]--[2022-04-13 Wed 18:03] =>  0:10
     CLOCK: [2022-04-13 Wed 16:42]--[2022-04-13 Wed 17:15] =>  0:33
     :END:
**** DONE Rendering extruded boxes                                 :painting:
     :LOGBOOK:
     CLOCK: [2022-04-13 Wed 18:03]--[2022-04-13 Wed 22:00] =>  3:57
     :END:
*** <2022-04-14 Thu>
**** DONE Rendering extruded boxes                                 :painting:
     :LOGBOOK:
     CLOCK: [2022-04-14 Thu 18:05]--[2022-04-14 Thu 22:02] =>  3:57
     CLOCK: [2022-04-14 Thu 17:11]--[2022-04-14 Thu 17:16] =>  0:05
     CLOCK: [2022-04-14 Thu 16:32]--[2022-04-14 Thu 16:59] =>  0:27
     :END:
*** <2022-04-15 Fri>
**** DONE Rendering extruded boxes                                 :painting:
     :LOGBOOK:
     CLOCK: [2022-04-15 Fri 18:26]--[2022-04-15 Fri 21:10] =>  2:44
     :END:
**** DONE Rendering spheres                                        :painting:
     :LOGBOOK:
     CLOCK: [2022-04-15 Fri 21:11]--[2022-04-15 Fri 21:49] =>  0:38
     :END:
*** <2022-04-16 Sat>
**** DONE Rendering spheres                                        :painting:
     :LOGBOOK:
     CLOCK: [2022-04-16 Sat 21:51]--[2022-04-16 Sat 22:05] =>  0:14
     CLOCK: [2022-04-16 Sat 18:02]--[2022-04-16 Sat 21:33] =>  3:31
     CLOCK: [2022-04-16 Sat 14:28]--[2022-04-16 Sat 16:16] =>  1:48
     CLOCK: [2022-04-16 Sat 12:18]--[2022-04-16 Sat 12:34] =>  0:16
     CLOCK: [2022-04-16 Sat 07:45]--[2022-04-16 Sat 11:34] =>  3:49
     :END:
*** <2022-04-17 Sun>
**** DONE Rendering spheres                                        :painting:
     :LOGBOOK:
     CLOCK: [2022-04-17 Sun 18:00]--[2022-04-17 Sun 20:33] =>  2:33
     CLOCK: [2022-04-17 Sun 12:50]--[2022-04-17 Sun 15:01] =>  2:11
     CLOCK: [2022-04-17 Sun 08:01]--[2022-04-17 Sun 12:00] =>  3:59
     :END:
**** DONE Blog                                                        :study:
     :LOGBOOK:
     CLOCK: [2022-04-17 Sun 20:33]--[2022-04-17 Sun 20:46] =>  0:13
     :END:
** Week 2
  #+BEGIN: clocktable :scope subtree :maxlevel 6 :block thisweek :tags t
  #+CAPTION: Clock summary at [2022-04-17 Sun 20:46], for week 2022-W15.
  | Tags     | Headline                            | Time    |       |      |      |
  |----------+-------------------------------------+---------+-------+------+------|
  |          | *Total time*                        | *44:30* |       |      |      |
  |----------+-------------------------------------+---------+-------+------+------|
  |          | \_  Week 4                          |         | 44:30 |      |      |
  |          | \_    <2022-04-11 Mon>              |         |       | 9:52 |      |
  | drawing  | \_      Scott Robertson perspective |         |       |      | 0:54 |
  | painting | \_      Rendering boxes             |         |       |      | 8:58 |
  |          | \_    <2022-04-12 Tue>              |         |       | 3:33 |      |
  | painting | \_      Rendering extruded boxes    |         |       |      | 3:33 |
  |          | \_    <2022-04-13 Wed>              |         |       | 4:40 |      |
  | 3D       | \_      Blender tutorial            |         |       |      | 0:43 |
  | painting | \_      Rendering extruded boxes    |         |       |      | 3:57 |
  |          | \_    <2022-04-14 Thu>              |         |       | 4:29 |      |
  | painting | \_      Rendering extruded boxes    |         |       |      | 4:29 |
  |          | \_    <2022-04-15 Fri>              |         |       | 3:22 |      |
  | painting | \_      Rendering extruded boxes    |         |       |      | 2:44 |
  | painting | \_      Rendering spheres           |         |       |      | 0:38 |
  |          | \_    <2022-04-16 Sat>              |         |       | 9:38 |      |
  | painting | \_      Rendering spheres           |         |       |      | 9:38 |
  |          | \_    <2022-04-17 Sun>              |         |       | 8:56 |      |
  | painting | \_      Rendering spheres           |         |       |      | 8:43 |
  | study    | \_      Blog                        |         |       |      | 0:13 |
  #+END:
  
  #+BEGIN: clocktable-by-tag :maxlevel 6 :match ("drawing" "study" "painting" "3D")
  | Tag      | Headline   | Time (h)  |
  |----------+------------+-----------|
  | drawing  | *Tag time* | *0h 54m*  |
  |----------+------------+-----------|
  | study    | *Tag time* | *0h 13m*  |
  |----------+------------+-----------|
  | painting | *Tag time* | *42h 40m* |
  |----------+------------+-----------|
  | 3D       | *Tag time* | *0h 43m*  |
  
  #+END:
*** <2022-04-18 Mon>
